{
  "ajedrezled":{
      "id":"ajedrezled",
      "thumbnail":"content/hackids/images/ajedrezled.jpg",
      "title":"Ajedrez Led",
      "description":"En este proyecto vamos a crear un dispositivo con el que podrás formar cualquier mensaje que quieras",
      "media":"<video controls> <source src='content/hackids/videos/ajedrezled.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
      "details":"<p>En este proyecto vamos a crear un dispositivo con el que podrás formar cualquier mensaje que quieras, crear juegos e incluso unirte a tus amigos a través de mensajes de luz. Con la ayuda de un programa vamos a órdenar a una matriz LED, una pantalla de 8x8, que muestre una serie de caracteres que aparecerán de acuerdo al tiempo que tú determines. Pero, para llevar a cabo este proyecto se necesita de una librería que vamos a cargar al programa. <p>",
      "mapa":"content/hackids/images/ajedrezled-480x382.jpg",
      "cartilla":"content/hackids/cartillas/ajedrezled.pdf"
    },
    "murcielago":{
        "id":"murcielago",
        "thumbnail":"content/hackids/images/murcielago.jpg",
        "title":"Ojos de Murcielago",
        "description":"¿Sabías que los murciélagos emiten ondas de sonido que, al rebotar sobre los objetos, producen ecos de retorno que les permiten ubicarse en el espacio? Así es como vuelan en la oscuridad.",
        "media":"<video controls> <source src='content/hackids/videos/murcielago.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
        "details":"<p>El sensor de ultra sonido que vamos a usar para este proyecto es nuestro murciélago; uno de los bafles emite una onda de sonido y el otro recibe el eco que, según el tiempo en el que se demora en retornar la onda, calcula la distancia a la que se encuentra el objeto. Si eres como un murciélago y no te gustan las sorpresas, si te asusta hasta tu sombra, si eres una de esas personas que siempre está alerta, este sensor de proximidad será tu mejor aliado. En este proyecto vamos a crear un sistema que te avisará si alguien se encuentra a menos de un metro ochenta de distancia. <p>",
        "mapa":"content/hackids/images/ojosmurcielago-480x382.jpg",
        "cartilla":"content/hackids/cartillas/murcielago.pdf"
    },
    "barco":{
        "id":"barco",
        "thumbnail":"content/hackids/images/barco.jpg",
        "title":"El barco cazador de tesoros",
        "description":"Este barco no es un barco pirata, este barco no es un barco pesquero, este barco no carga ni lleva nada; este barco está hecho de imaginación y pensamiento y navegará si tú quieres surcando el viento. ",
        "media":"<video controls> <source src='content/hackids/videos/barco.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
        "details":"<p>Este barco funciona así: en el Arduino vamos a cargar un código que controla la dirección del servo motor, que en este caso será el timonel del navío. Cuando terminemos de montar el barco lo podremos manejar con los botones del control. Las instrucciones que le demos al barco por medio del control son recibidas por un receptor infrarrojo que manda la información al chip que está conectado a la protoboard. Podremos desactivar el circuito con un interruptor que pondremos en la protoboard. El sistema está diseñado para que pueda ser montado sobre botellas recicladas.</p><p>Inventa la mejor manera de unir el mecanismo a las botellas, ahora pon tu barco sobre el agua y a ¡cazar tesoros!</p><p>Antes de empezar con la conexiones físicas copia el código del Barco que está en la parte final de la cartilla y cárgalo en el Arduino. Recuerda que debes instalar la librería IRremote. Ten cuidado con los espacios, los signos y las mayúsculas, ya que cualquier error que se pase afecta la programación y las órdenes que recibe el Arduino.<p>",
        "mapa":"content/hackids/images/barcocazador-480x382.jpg",
        "cartilla":"content/hackids/cartillas/barco.pdf"
    },
    "carro":{
        "id":"carro",
        "thumbnail":"content/hackids/images/carro.jpg",
        "title":"Carro seguidor de luz",
        "description":"¿Te imaginas que pudiéramos crear un carro con ojos? Hagamos que los motores de este auto se activen dependiendo de la intensidad lumínica que perciban sus ojos.",
        "media":"<video controls> <source src='content/hackids/videos/carro.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
        "details":"<p>Vamos a hacer un circuito alimentado por una pila de 9V. Las dos fotorresistencias que vamos a conectar a la protoboard, los ojos de nuestro auto, varían la oposición que ejercen a la corriente dependiendo de la cantidad de luz que reciben. Las fotorresistencias emiten una señal que después es amplificada por los transistores. Esta señal amplificada llega a los motores y el carro empieza a moverse variando la velocidad según la cantidad de luz que haya en el ambiente.<p>",
        "mapa":"content/hackids/images/carroluz-480x382.jpg",
        "cartilla":"content/hackids/cartillas/carro.pdf"
    },
    "linterna":{
        "id":"linterna",
        "thumbnail":"content/hackids/images/linterna.jpg",
        "title":"Linterna RGB",
        "description":"¿Sabías que el código morse es un sistema que, mediante señales emitidas de forma intermitente, representa letras e incluso números? Creemos nuestro propio código morse con señales intermitentes de colores.",
        "media":"<video controls> <source src='content/hackids/videos/linterna.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
        "details":"<p>Vamos a crear un circuito con sus variables mínimas. Ya sabemos que un campo electromagnético es una pista sobre la cual van a transitar electrones que van de un lado a otro; nosotros vamos a ordenarles que transiten de forma controlada a través de cuatro diodos que hacen que la energía solo fluya en un sentido y además emitan luz, cada uno de un color diferente: verde, rojo, azul y blanco. Vamos a conectar nuestra fuente de energía, una batería de 9V, a un regulador que, a su vez, alimenta los LEDS quienes regulan su intensidad lumí- nica cuando son conectados a una resistencia variable, es decir a un potenciómetro. Teniendo la linterna armada podemos inventar con ésta un código de comunicación con nuestros amigos.<p>",
        "mapa":"content/hackids/images/linterna-480x382.jpg",
        "cartilla":"content/hackids/cartillas/linterna.pdf"
    },
    "alarmate":{
        "id":"alarmate",
        "thumbnail":"content/hackids/images/alarmate.jpg",
        "title":"Alarmate",
        "description":"¿Sabías que el oído humano percibe frecuencias de sonido comprendidas entre los 20 Hz (la frecuencia más grave) y los 20.000 Hz (la frecuencia más aguda)?. Los animales acuáticos pueden percibir frecuencias de hasta 160 kHz; este atributo permite a los tiburones, por ejemplo, cazar a sus presas ya que logran percibir campos electromagnéticos a distancias enormes.",
        "media":"<video controls> <source src='content/hackids/videos/alarmate.mp4' type='video/mp4'>Your browser does not support the video tag.</video>",
        "details":"<p>En este proyecto vamos a producir una frecuencia de sonido de 1000 Hz (1kHz), un sonido que no solo es audible para el ser humano, también es bastante agudo. ¡Seguro esta alarma alertará a cualquiera que la oiga! </p><p>Vamos a crear un circuito conectando una batería de 9 voltios a un regulador que reducirá la corriente a 5 voltios, a su vez, un oscilador 555 regulará el paso de la energía en pulsaciones con un cierto ritmo y así logrará generar la señal de salida de 1kHz. Un switch cerrará el circuito permitiendo el paso de la señal para activar el parlante (Buzzer) y generar un sonido.<p>",
        "mapa":"content/hackids/images/alarmate-480x382.jpg",
        "cartilla":"content/hackids/cartillas/alarmate.pdf"
  }

}
